templates_servicios/ambiente_test/SOAP_DIPRECA_ConsultaImponentes_input.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:val="http://valida.aem.gob.cl" xmlns:xd="http://www.w3.org/2000/09/xmldsig#">
   <soapenv:Header/>
   <soapenv:Body>
      <val:sobre>
         <val:encabezado>
            <val:idSobre>ELPISEE.inputParameter.headerParameters['id_sobre']</val:idSobre>			
            <val:fechaHora>ELPISEE.inputParameter.headerParameters['fecha_hora']</val:fechaHora>
            <val:proveedor>
               <val:nombre>ELPISEE.inputParameter.headerParameters['nombre_proveedor']</val:nombre>
               <val:servicios>
                  <val:servicio>ELPISEE.inputParameter.headerParameters['nombre_servicio']</val:servicio>
                  <val:respuestaServicio>
                     <val:estado>SI</val:estado>
                     <val:glosa>RESPUESTA EXITOSA</val:glosa>
                  </val:respuestaServicio>
               </val:servicios>
            </val:proveedor>
            <val:consumidor>
               <val:nombre>ELPISEE.inputParameter.headerParameters['nombre_consumidor']</val:nombre>
               <val:tramite>ELPISEE.inputParameter.headerParameters['nombre_tramite']</val:tramite>
               <val:certificado>
                  <xd:X509Data>
                     <xd:X509IssuerSerial>
                        <xd:X509IssuerName>IN</xd:X509IssuerName>
                        <xd:X509SerialNumber>0</xd:X509SerialNumber>
                     </xd:X509IssuerSerial>
                  </xd:X509Data>
               </val:certificado>
            </val:consumidor>
            <val:fechaHoraReq>ELPISEE.inputParameter.headerParameters['fecha_hora_req']</val:fechaHoraReq>
            <val:emisor>ELPISEE.inputParameter.headerParameters['nombre_consumidor']</val:emisor>
            <val:metadataOperacional>
               <val:estadoSobre>00</val:estadoSobre>
               <val:glosaSobre>REST</val:glosaSobre>               
            </val:metadataOperacional>
         </val:encabezado>
         <val:cuerpo>
            <val:documento>
               <val:EntradaDatosImponente>
                  <val:RutIPS>
                     <val:numero>ELPISEE.inputParameter.bodyParameters['rut']</val:numero>
                     <val:dv>ELPISEE.inputParameter.bodyParameters['dv']</val:dv>					 
                  </val:RutIPS>
               </val:EntradaDatosImponente>
            </val:documento>
         </val:cuerpo>
      </val:sobre>
   </soapenv:Body>
</soapenv:Envelope>